In [28]:
import pandas as pd
import numpy as np

In [29]:
#Q1: Create a Series with indexes = 1, 2, 3 and has three names.
names = ['Amani', 'Amal', 'Nada']
Ser = pd.Series(names, index=[1,2,3])
Ser

1    Amani
2     Amal
3     Nada
dtype: object

In [30]:
#Q2: Change indexes to 11, 12, 13.
Ser.index = [11,12,13]
Ser

11    Amani
12     Amal
13     Nada
dtype: object

In [31]:
#Q3: Retrieve First and second elements.
Ser[0:2]

11    Amani
12     Amal
dtype: object

In [32]:
#Q4: Add duplicate elements, then remove the duplication
s4 = pd.Series({13: 'Nada'})
Ser = Ser.append(s4)
Ser

Ser.drop_duplicates()

11    Amani
12     Amal
13     Nada
13     Nada
dtype: object

C:\Users\amani\AppData\Local\Temp\ipykernel_8780\3631172291.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  Ser = Ser.append(s4)

11    Amani
12     Amal
13     Nada
dtype: object

In [36]:
#Q5: Create a Students DataFrame has three columns (ID, Name)
data      = {'ID' :   [11, 22, 33],
            'Name': ['Amani', 'Nada', 'Amal']}

Students = pd.DataFrame(data)
Students

   ID   Name
0  11  Amani
1  22   Nada
2  33   Amal

In [44]:
#Q6: Read educ_figdp_1_Data.csv file
urlfile = "https://raw.githubusercontent.com/Data-Science-July31/Lectures/main/Day%237/educ_figdp_1_Data.csv"
edu = pd.read_csv(urlfile)
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [ ]:
#Q7: What is the difference between loc and slicing?

#loc use the index labels as references
#slice use the position as references